Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_storage_bucket.your-bucket-name-sandeeps has been deleted
- resource "google_storage_bucket" "your-bucket-name-sandeeps" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "dep"                        = "compliance"
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "your-bucket-name-sandeeps" -> null
      - labels                      = {
          - "dep" = "compliance"
        } -> null
      - location                    = "US" -> null
      - name                        = "your-bucket-name-sandeeps" -> null
      - project                     = "sunlit-cab-463104-m6" -> null
      - project_number              = 1025178241939 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/your-bucket-name-sandeeps" -> null
      - storage_class               = "NEARLINE" -> null
      - terraform_labels            = {
          - "dep"                        = "compliance"
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-24T05:59:25.092Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-24T05:59:25.092Z" -> null
      - url                         = "gs://your-bucket-name-sandeeps" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - lifecycle_rule {
          - action {
              - type = "Delete" -> null
            }

          - condition {
              - age                                     = 6 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = false -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
        }
      - lifecycle_rule {
          - action {
              - storage_class = "COLDLINE" -> null
              - type          = "SetStorageClass" -> null
            }

          - condition {
              - age                                     = 3 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = false -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
        }
      - lifecycle_rule {
          - action {
              - type = "AbortIncompleteMultipartUpload" -> null
            }

          - condition {
              - age                                     = 2 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = false -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
            }
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-24T05:59:25.092Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }
  # google_storage_bucket_object.object-sandeeps has been deleted
- resource "google_storage_bucket_object" "object-sandeeps" {
      - bucket           = "your-bucket-name-sandeeps" -> null
      - content_type     = "image/webp" -> null
      - crc32c           = "eSXAWg==" -> null
      - detect_md5hash   = "k+eo8dai8ZxTYraTEPPBVg==" -> null
      - event_based_hold = false -> null
      - generation       = 1750744765673427 -> null
      - id               = "your-bucket-name-sandeeps-iphone_logo" -> null
      - md5hash          = "k+eo8dai8ZxTYraTEPPBVg==" -> null
      - md5hexhash       = "93e7a8f1d6a2f19c5362b69310f3c156" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/your-bucket-name-sandeeps/o/iphone_logo?generation=1750744765673427&alt=media" -> null
      - name             = "iphone_logo" -> null
      - output_name      = "iphone_logo" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/your-bucket-name-sandeeps/o/iphone_logo" -> null
      - source           = "p2.jpg" -> null
      - storage_class    = "NEARLINE" -> null
      - temporary_hold   = false -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_firewall.allow-icmp will be created
+ resource "google_compute_firewall" "allow-icmp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-icmp-sandeep"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "sunlit-cab-463104-m6"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "14.97.94.230/32",
        ]

      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_network.auto-vpc-tf-unique-names will be created
+ resource "google_compute_network" "auto-vpc-tf-unique-names" {
      + auto_create_subnetworks                   = true
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "auto-vpc-tf-unique-names"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_network.custom-vpc-tf-uniques will be created
+ resource "google_compute_network" "custom-vpc-tf-uniques" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "custom-vpc-tf-uniques"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "sunlit-cab-463104-m6"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.subnet-custom-vpc-tfv will be created
+ resource "google_compute_subnetwork" "subnet-custom-vpc-tfv" {
      + creation_timestamp         = (known after apply)
      + enable_flow_logs           = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.1.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "subnet-custom-vpc-tfvc"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "sunlit-cab-463104-m6"
      + purpose                    = (known after apply)
      + region                     = "asia-southeast1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range           = (known after apply)
          + range_name              = (known after apply)
          + reserved_internal_range = (known after apply)
        }
    }

  # google_storage_bucket.your-bucket-name-sandeeps will be created
+ resource "google_storage_bucket" "your-bucket-name-sandeeps" {
      + effective_labels            = {
          + "dep"                        = "compliance"
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = {
          + "dep" = "compliance"
        }
      + location                    = "US"
      + name                        = "your-bucket-name-sandeeps"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "NEARLINE"
      + terraform_labels            = {
          + "dep"                        = "compliance"
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 6
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 3
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
      + lifecycle_rule {
          + action {
              + type = "AbortIncompleteMultipartUpload"
            }

          + condition {
              + age                   = 2
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # google_storage_bucket_object.object-sandeeps will be created
+ resource "google_storage_bucket_object" "object-sandeeps" {
      + bucket         = "your-bucket-name-sandeeps"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "iphone_logo"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "p2.jpg"
      + storage_class  = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ auto_vpc_name   = (known after apply)
+ custom_vpc_name = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c6ec2b3f7bd8:4141/lock?id=Sandeep13Paul%252Fterraform-tutorial%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
